app/controllers/books_controller.rb

    def create
        book_params = params.require(:book).permit(:year, :month, :inout, :category, :amount)
    @book = Book.new(book_params)
      if @book.save
---
INSERT INTO "books" ("inout", "category", "year", "month", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["inout", 2], ["category", "美容"], ["year", 2025], ["month", 1], ["amount", 2300], ["created_at", "2025-01-31 09:38:46.548883"], ["updated_at", "2025-01-31 09:38:46.548883"]]

    def update
        @book = Book.find(params[:id])
        book_params = params.require(:book).permit(:year, :month, :inout, :category, :amount)
        if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "inout" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["inout", 0], ["updated_at", "2025-02-06 07:38:41.307158"], ["id", 2]]