app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 2]]
SELECT "books".* FROM "books" WHERE "books"."year" = ? AND "books"."month" = ?  [["year", 0], ["month", 2]]
---
    def index
      @books = Book.where(user_id: session[:user_id])
      @books = @books.where(year: params[:year]) if params[:year].present?
      @books = @books.where(month: params[:month]) if params[:month].present?