app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    user_params = params.require(:user).permit(:name, :email, :password,
    :password_confirmation)
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "らんてくんaaaa"], ["updated_at", "2025-02-07 12:16:41.126457"], ["id", 2]]
---
  def update
    @user = User.find(session[:user_id])
    user_params = params.require(:user).permit(:name, :email)
    if @user.update(user_params)